# Questions
1. Analyse the Data Quality of Retail Datasets
2. For columns with missing values, find the count of missing values
3. Find the number of Respondents of a recent Email campaign
4. Provide the list of Repondents in a Excel format with Customer details 
5. Transactions data takes too much space. Can you reduce the size for storing?

# Data Import and Export

In [73]:
#Import Libraries

## Analyse the Data Quality of Retail Datasets
**Concepts Covered:**
1. Reading comma seperated files (.read_csv())
2. Gathering meta data from Dataframes (.info())
3. Extracting Summary Statistics from Dataframes (.describe())
4. Showing descriptive statistics for categorical variables (include = 'all')
5. (.shape) to find the number of rows and columns in a Dataframe 
6. Investigate datatypes in a dataframe using (.dtypes) and (.column)
7. Convert Date columns to datetime format (.to_datetime())

### Reading comma seperated files (.read_csv())

In [74]:
#We can import a CSV file, provided its present in the same folder as this notebook

In [75]:
#Similarly we can import the transactions and summary data

### Gathering meta data from Dataframes (.info())

In [76]:
#Using info() will provide us with the column names and their data types

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6889 entries, 0 to 6888
Data columns (total 13 columns):
customer_id           6889 non-null object
tran_amount_2011      6501 non-null float64
tran_amount_2012      6809 non-null float64
tran_amount_2013      6804 non-null float64
tran_amount_2014      6801 non-null float64
tran_amount_2015      4225 non-null float64
transactions_2011     6501 non-null float64
transactions_2012     6809 non-null float64
transactions_2013     6804 non-null float64
transactions_2014     6801 non-null float64
transactions_2015     4225 non-null float64
First_Transaction     6889 non-null object
Latest_Transaction    6889 non-null object
dtypes: float64(10), object(3)
memory usage: 699.8+ KB

### Extracting Summary Statistics from Dataframes (.describe())

In [77]:
#Using describe() will provide us with descriptive statistics of the dataframe

,tran_amount_2011,tran_amount_2012,tran_amount_2013,tran_amount_2014,tran_amount_2015,transactions_2011,transactions_2012,transactions_2013,transactions_2014,transactions_2015
count,6501.000000,6809.000000,6804.000000,6801.000000,4225.000000,6501.000000,6809.000000,6804.000000,6801.000000,4225.000000
mean,206.174281,310.853136,314.134039,307.970593,103.000000,3.177665,4.779116,4.835979,4.738421,1.578935
std,128.092642,175.768279,175.743597,170.769072,66.204169,1.697319,2.265040,2.277427,2.192086,0.840771
min,10.000000,10.000000,10.000000,10.000000,10.000000,1.000000,1.000000,1.000000,1.000000,1.000000
25%,104.000000,175.000000,175.000000,175.000000,56.000000,2.000000,3.000000,3.000000,3.000000,1.000000
50%,184.000000,288.000000,293.000000,288.000000,85.000000,3.000000,5.000000,5.000000,5.000000,1.000000
75%,282.000000,426.000000,430.000000,418.000000,136.000000,4.000000,6.000000,6.000000,6.000000,2.000000
max,849.000000,1242.000000,1317.000000,1029.000000,538.000000,11.000000,18.000000,17.000000,15.000000,7.000000

In [78]:
#Lets check it for customers dataframe

               Age
count  6830.000000
mean     38.879795
std      10.541763
min      18.000000
25%      32.000000
50%      37.000000
75%      44.000000
max      92.000000

### Showing descriptive statistics for categorical variables (include = 'all')

In [1]:
#We can get the descriptive statistics for the categorical columns too

### (.shape) to find the number of rows and columns in a Dataframe

In [80]:
#Using shape we can find out the number of unique customers in the Dataframe

(6901, 5)

In [81]:
#Transaction will have a huge number of records made by each of the customers in the above table

(125000, 3)

In [82]:
#Summary of transaction as customer level, 2 customers did not make purchase from Retail Shop

(6889, 13)

### Investigate datatypes in a dataframe using (.dtypes) and (.column)

In [83]:
#Lets check the transaction data

  customer_id trans_date  tran_amount
0      CS5295  11-Feb-13           35

In [84]:
#Instead info(), we could use (.dtypes) to get the Datatypes of all the columns

customer_id    object
trans_date     object
tran_amount     int64
dtype: object

In [85]:
#Similary we could get the list of column names using (.columns)

Index(['customer_id', 'trans_date', 'tran_amount'], dtype='object')

### Convert Date columns to datetime format (.to_datetime())

In [86]:
#Lets convert trans_date column to datetime datatype

In [87]:
#Lets check the datatypes now

customer_id            object
trans_date     datetime64[ns]
tran_amount             int64
dtype: object

In [88]:
#Similarly we could do the same for date columns in summary dataframe

,customer_id,tran_amount_2011,tran_amount_2012,tran_amount_2013,tran_amount_2014,tran_amount_2015,transactions_2011,transactions_2012,transactions_2013,transactions_2014,transactions_2015,First_Transaction,Latest_Transaction
0,CS2945,153.0,516.0,173.0,1029.0,40.0,2.0,7.0,3.0,13.0,1.0,18-May-11,08-Mar-15

In [89]:
#Lets convert trans_date column to datetime datatype

In [90]:
#Lets check the datatypes

customer_id                   object
tran_amount_2011             float64
tran_amount_2012             float64
tran_amount_2013             float64
tran_amount_2014             float64
tran_amount_2015             float64
transactions_2011            float64
transactions_2012            float64
transactions_2013            float64
transactions_2014            float64
transactions_2015            float64
First_Transaction     datetime64[ns]
Latest_Transaction    datetime64[ns]
dtype: object

## For columns with missing values, find the count of missing values
**Concepts Covered:**
1. Using (.isnull()) to find missing values
2. Using (.isnull() & .sum()) to find count of missing values

In [91]:
#lets check for missing values in Retail Summary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6889 entries, 0 to 6888
Data columns (total 13 columns):
customer_id           6889 non-null object
tran_amount_2011      6501 non-null float64
tran_amount_2012      6809 non-null float64
tran_amount_2013      6804 non-null float64
tran_amount_2014      6801 non-null float64
tran_amount_2015      4225 non-null float64
transactions_2011     6501 non-null float64
transactions_2012     6809 non-null float64
transactions_2013     6804 non-null float64
transactions_2014     6801 non-null float64
transactions_2015     4225 non-null float64
First_Transaction     6889 non-null datetime64[ns]
Latest_Transaction    6889 non-null datetime64[ns]
dtypes: datetime64[ns](2), float64(10), object(1)
memory usage: 699.8+ KB

### Using (.isnull()) to find missing values

In [92]:
#We can get the count of missing values using (.isnull())

,customer_id,tran_amount_2011,tran_amount_2012,tran_amount_2013,tran_amount_2014,tran_amount_2015,transactions_2011,transactions_2012,transactions_2013,transactions_2014,transactions_2015,First_Transaction,Latest_Transaction
0,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,True,False,False,False,False,True,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,True,False,False,False,False,True,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6884,False,False,False,False,True,True,False,False,False,True,True,False,False
6885,False,False,False,False,True,True,False,False,False,True,True,False,False
6886,False,False,False,False,True,True,False,False,False,True,True,False,False
6887,False,False,False,False,True,True,False,False,False,True,True,False,False
6888,False,False,False,False,True,True,False,False,False,True,True,False,False

### Using (.isnull() & .sum()) to find count of missing values

In [105]:
#We now get the count of True's using the (.sum())

customer_id              0
tran_amount_2011       388
tran_amount_2012        80
tran_amount_2013        85
tran_amount_2014        88
tran_amount_2015      2664
transactions_2011      388
transactions_2012       80
transactions_2013       85
transactions_2014       88
transactions_2015     2664
First_Transaction        0
Latest_Transaction       0
dtype: int64

In [94]:
#Similarly we could check it for customers

customer_id     0
Name            0
Geography       0
Gender          0
Age            71
dtype: int64

## Find the number of Respondents of a recent Email campaign
**Concepts Covered:**
1. Import other formats of data (json)

### Import JSON format data into Pandas

In [95]:
#Import Email response data which is in JSON format

In [96]:
#Lets check the data

     customer_id  response
0         CS1112         0
1         CS1113         0
2         CS1114         1
3         CS1115         1
4         CS1116         1
...          ...       ...
6879      CS8996         0
6880      CS8997         0
6881      CS8998         0
6882      CS8999         0
6883      CS9000         0

[6884 rows x 2 columns]

In [103]:
#We will sum up the response column to get the number of respondents

647

## Provide the list of Repondents in a Excel format with Customer details 
**Concepts Covered:**
1. Export Single Dataframe to Excel (.to_Excel())
1. Export Multiple Dataframe to Excel (.ExcelWriter())

### Export Single Dataframe to Excel (.to_excel())

In [98]:
#If we want to export the JSON data to Excel we could use the .to_excel() method

In [99]:
#We could remove the Dataframe index, using the (index = False) argument

### Export Multiple Dataframe to Excel (.ExcelWriter())

In [100]:
#Create a Pandas Excel Writer using (.ExcelWriter())

In [101]:
#Export mutiple dataframes using different sheet name

In [102]:
#Close the Excel Writer and output the Excel file

In [ ]:
#While exporting we can compress and store data

## Transactions data takes too much space. Can you reduce the size for storing?
1. Export data with compression using (compression = 'gzip') argument
2. Import compressed(.gz) files

In [ ]:
#We can import is using the (.read_csv()) method

In [ ]:
#Lets check the data

# END
**Pandas Concepts Covered:**
1. Reading data into Pandas Dataframes (.read_csv(), .read_json())
2. Investigating data (.info(), .describe(), dtypes, shape, columns)
3. Converting Date columns to date time format (.to_datetime())
4. Finding count of missing values in a column (.isnull() and .sum())
5. Export dataframe(dataframes) (.to_csv(), ExcelWriter())
6. Compressing data while exporting